{"body":"I agree, your T is on the low-end of normal, and that it could be a contributing factor.\n\nIf you were taking them completely apart, I am not positive if it would increase alcohol tolerance (I am not that privy to really specific GABA physiology), but it would make sense if it did so. Again though, the issue is more long-term damage to your GABA system from using either of them.\n\nThey are both huge band-aids for anxiety and will only make it worse, which is why I say nothing good ever comes of its use for treating a reoccuring problem.","created_utc":"1404827723"}
{"body":"Hold on here, picamilon breaks down once it crosses the blood brain barrier, making GABA more plentiful in the CNS. Phenibut does not break down, this means different binding affinities, as seen with phenibuts predominance on GABA-b receptors contributing to its social effects. While they both effect the GABA system they effect it in different ways with different Ki values on their receptors. ","created_utc":"1395602195"}
{"body":"Whoa.  So This is my first time taking racetams in years.  Ordered a drink and another at the local bar to take the edge off and it really went to my head in a stimulating way.  Something is up with the GABA system here.  Alcohol never hits me like this.\n\n","created_utc":"1404857499"}
{"body":"Swan. At first I was getting anxiety from it but it wasn't too bad. The more I used it the worse it got and for my girlfriend too. I was using the typical dose on the bottle and then down to one capsule a sit got worse. She stopped using it because she was getting anxiety but I kept using it. By then even one capsule would trigger a lot of anxiety and then I started experiencing the brain zaps which really freaked me out. I felt I was experiencing some psychological issues while using Ashwaghanda, everything felt like It wasn't me looking through these eyes. Like I was experiencing someone else's life. The brain zaps were very unpleasant and Google websites say it is because of abnormal Serotonin levels.\n\nI think my GABA system is really borked since a time when I accidently ate an MASSIVE amount of marijuana and had a full nervous breakdown and psychosis. Since then I've been dealing with a lot of panic attacks and herbs such as Ashwaghanda or anything that supposedly influences the GABA system gives me panic attacks. However stimulants which excite the nervous system do not.\n\nThe thing that strikes me is that my GF experienced the anxiety on Ashwaghanda so ti is not just someone with panic attack problems like me. ","created_utc":"1480759705"}
{"body":"Have you seen a psychiatrist? SSRIs can be very effective for anxiety, and they tend to work for a very long time. You can't interfere directly with the GABA system without risking addiction, tolerance, and withdrawal. \n\nAs far as nootropics go, tianeptine is probably your best bet. While it has a different mechanism of action, I find its effects to somewhat resemble phenibut. I found ashwagandha and bacopa to be too sedating. Magnesium is good to take at night. L-Theanine is also helpful, but not every day. ","created_utc":"1404107990"}
{"body":"Lactobacillus ingestion also augments the GABA system in the brains of mice:\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/21876150","created_utc":"1419909387"}
{"body":"Are you trying to imply that you know more about phenibut than I do? Please provide evidence for this claim\n\n&gt;over time down regulating your GABA system has dire consequences\n\nYour GABA system isn't a thing by the way. Phenibut is a GABAb agonist, and the obvious implication of your comment is that phenibut withdrawal can lead to kindling/seizures or death, which isn't true at all, and even alluding to \"dire\" consequences shows that you are ignorant about phenibut. That's perfectly fine, I don't expect you to be an expert on a compound that you don't take, but it's wrong to dissuade people from using a compound that improves their quality of life by making shit up. ","created_utc":"1480354414"}
{"body":"I'm glad that worked out well for you although it may not be an advisable combo in general as ashwagandha also has an effect on the GABA system [(source)](http://examine.com/supplements/Ashwagandha/#summary5-3), which is why it makes a great natural non addictive sleeping pill for some. It's hard to know exactly how it would interact with phenibut but as it's quite a powerful GABAergic i'd advise against it.","created_utc":"1415900448"}
{"body":"Your response is atypical. Me, my roommate, my mom, and six of my friends have been using it to great effect for over a month now. Either you have an abnormal GABA system or you didn't actually get theanine","created_utc":"1408139794"}
{"body":"What dosage did you start off? Those doses are huge, by the way. In a day, you take more than I take in a month. I hope you're alright. Just FYI, though, I've had friends who were heroin/meth addicts and they said the same thing. They have it under control, helps their performance, they'll just taper off, etc, etc. I'm not saying you're as bad as them, just that it is difficult to distinguish the difference.  \n \nHave you missed a day or two for any reason? I understand withdrawal kicks in fast and can go from \"I feel shitty\" to you finding out that you've been checked into the hospital because you had a psychotic fit, in hours.  \n  \nThe GABA system is serious fucking business.","created_utc":"1407542778"}
{"body":"Nothing that is addictive is a true nootropic by definition. Phenibut may not impair cognition at normal doses, but it doesn't improve it, most people don't use it at normal doses, and over time down regulating your GABA system has dire consequences. It's an alternative to alcohol, not a nootropic.","created_utc":"1479625436"}
{"body":"That's possibly true. It's more true with small doses and also with food taken. \n\nI think all drug withdrawal is from escalating acute crashes. And most people refuse drugs before they wear off truly. \n\nFor example Kratom crashes and I recover before the day is over. I think crashing with all drugs usually occurs during active effects. It may be the sensation or downstream effects that occur from reduction. \n\nI also actually enjoy mild opiate comedowns. Kratom most especially is bright and sexual feeling when it wears off. Tianeptine feels like LSD microdosed when it wears off. \n\nTianeptine is too anxious when it wears off tho. \n\nI'll try more sulphate soon. \n\nAlso consider kindling which seems to occur from harsh rapid changes of systems. Mainly it's the GABA system for the research but I'm pretty sure all systems work this way. \n\n\n\n","created_utc":"1476309316"}
{"body":"Hmm, I am also a male in my early 20s with aspergers. From what I've read about requip, it doesn't sound like something I would want to be taking. You should ask your doc about Gabapentin enacarbil. It works on the gaba system promoting relaxation and sociability, and also helps with RLS. ","created_utc":"1419831775"}
{"body":"Definitely a long term nootropic that boosts neurogenesis with little tolerance or addiction potential. Some benefit to overall health, mood and energy would also be nice. Phenibut is a horrible choice in my opinion...yikes. Long term use even weekly wrecks the gaba system and believe me, that is far from nootropic or enjoyable. Semax was a close second for me but I'd have to choose intranasal insulin.","created_utc":"1475963207"}
{"body":"Yes, 300mg is a pretty responsible dose. I mean GABA system is so complicated it's unfair to say phenibut/benzo daily use will do damage, in many, like yourself it doesn't do anything bad at all, in some even after one day they feel crazy bad, brain fog and similar. \n\nHaven't tried the FAA version yet since HCL was always cheaper, but must give it a go soon. ","created_utc":"1474061311"}
{"body":"To add to what has already been said, sure it is worth a try. Avoid other things that are serotonergic, like 5-HTP, and this is personal opinion, but don't mess around with phenibut in general. Nothing good ever comes out of messing around with your GABA system with that kind of stuff.\n\nOh, and your T and Vitamin D levels are pretty normal. Some people think there is a benefit to getting it towards the higher end (~75), if you want to try, that would be fine. IIRC 2,000 IUs day gets 95% of people to that level.","created_utc":"1404494824"}
{"body":"Your body cleaves the N-Nicotinoyl part of picamilon once it crosses the BBB and therefore it becomes GABA directly, Phenibut does not turn into GABA in the brain neither does GHB in significant amounts. I'm just clearing up the biochemistry behind it, but there is a difference whether you think it's relevant or not. Phenibut and GHB are not GABA pro-drugs, they are GABA analogues that have their own effects that are stronger than your body's natural GABA. Picamilon is a GABA prodrug that works to increase GABA levels directly in the brain, and as far as we know it does not bind to GABA receptors at all without first being converted to GABA after crossing BBB. ALL Im saying is Phenibut and GHB are vastly different from something that directly inreases GABA levels in the brain. Phenibut and GHB bind to the receptors themselves and do not get converted to GABA, they are GABA analogues but never get turned to GABA inside the body in significant levels. I never said he should take anything I'm just providing scientifically accurate information about what does what and how it affects your GABA system (not just by being an agonist, but by also increasing levels of GABA in the brain, both are totally valid forms of obtaining gabaergic effects in the end, both have their strenghts and weaknesses).","created_utc":"1501946437"}
{"body":"The way I see human enhancement, there are at least three paths that can work together-  lifestyle/activities, chemical/pharm/vitamins, and technological/biological mod.  I won't cover the latter since beyond prosthetics and AR the tech really isn't there.  Within these buckets, there is the practical intellectual, creative intellectual and physical areas that I tried and am going to again try to increase performance in.\n\nI'm going to cover just a few things, I can post later a full recap but I've also tried a number of \"recreational\" substances that have therapeautic benefit in these areas (like kava, kratom, mescaline, etc)\n\n&gt; any recommendations regarding what did and did not work?\n\n**what worked**\n\nPiracetam worked really well for me.  From my notes, which I can post in a separate thread, 1600mg + 250mg choline over the course of a few weeks really upped my ability to remember details from class and quickly recall details from conversations with people.  There was an alertness component noticed early on.  I remember taking it while doing a quant heavy course requirement (i was in an undergrad business program) Operations Management (think 6 sigma sort of shit) and got an A.  I was smoking marijuana regularly and drinking on weekends - as well as working out regularly - during this time.  I noticed a reduced desire to drink during this time and an increased response to alcohol - I think thats because piracetam affects the GABA system in some way.\n\nPiracetam reduced my need for coffee but synergized well with it.  I noticed less caffeine produced anxiety.  It was around this time I actually developed a coffee habit that unfortunately I was unable to kick for a while even after I tapered off of piracetam.  When I tapered off, there was no immediate change but I think over time I returned to my natural less focused state of consciousness.  I also developed a hand tremor around this time, but I suspect that was related to either caffeine or stress due to doing a full courseload and working 20 hrs a week at a consulting internship.  The tremor ceased after like 4 months.\n\nPhenibut worked almost too well and is less drowsy than xanax.  It seemed habit forming for a guy like me who needs to chill more so I didn't experiment with it too much.  I thought about getting some more Phenibut but my GP will give me xanax occasionally due to my travel schedule (helps me sleep on international flights) and I don't need to start a bad habit.\n\nYoga really fucking works.  I used to do Kundalini Yoga (on my own) and I may start up again once im in better shape.  Its tough to do right if you arent already in good shape - but it relaxes you, helps your flexibility and gives you more control over your body.  Back in college and the immediate years following, yoga definitely helped the quality of my sex life and lifting weights helped the quantity/variety.\n\n**what didn't**\n\nI tried St Johns Wort (SJW) to treat self diagnosed dysthymia.  It did not do very much beyond placebo and after 6 months of testing dose I ceased treatment and it eventually got worse, resulting in full blown anxiety &amp; depression.  I dont think the SJW really did anything for better or for worse for me.  I also tried things like 5htp and l tyrosine.  Nada.  Only thing that kicked this things ass was Zoloft and a few years of therapy.\n\n&gt; Anything around today that you wish was around 8 years ago?\n\nI'm not sure modafinil and similar substances were really widespread though there were talks of it on forums.  Adrafinil definitely wasn't around.  There is also more evidence that you should take larger doses of piracetam now then I think was around 8 years ago.  Back then it was 800-1600mg recommendations.  I don't think there was much of a forum for purity testing of these things either.\n\nFinally, I used adderall to study a lot and the come down was hard.  Adderall XR was better but Vyvanse really changed the game and in my mind is the best amphetamine salt type drug for therepeautic purposes - but it still has the drawbacks of amphetamines such as tolerance and cardio side effects.\n\nWe had Erowid back then but I think interest in nootropics has really taken off as the whole \"upgrade/singularity\" lifestyle has become more mainstream.\n\nAnother thing unrelated to nootropics - I didn't know about buffered creatine back then.  Its a game changer for me.  No more sugary drinks with tons of creatine monohydrate - just 1 or 2 pills of kre-alkalyn and water.\n\n&gt; Lifestyle wise, what had that biggest payoff 8 years later?\n\nI think all the research I was doing and experimentation was motivated by a pure desire to be better - and in doing so, I was also able to acknowledge a lot of flaws and realize that in some ways, I was self medicating.  So that laid the groundwork for me seeking help on my depression and adhd.\n\nThings like the racetams then and amps now get me through school and work when needed, but they didn't and don't really change my life in anyway.\n\nThe best thing I ever did was therapy for those psychological sorts of things.  And it really improved my relationship with my family, friends, significant others and with substances.  Zoloft definitely helped here.\n\nThe other big thing is exercise.  I regret that I ever stopped though for a while I was focused on building muscle that I forgot about having a balanced body.  When I was a kid I used to love rock climbing.  A few years ago, before I stopped working out entirely and was just lifting, I went to a rock gym and I could do the easy courses without issue.  But the moderate and hard kicked my ass and I couldnt complete what I used to do easily as a kid - I focused too much on mass without building true strength.  So I recommend focusing on body weight exercise, cardio and plyometrics.  Make sure you are balancing mass with practical strength.  The mass I built, however, still pays off now since my biceps and triceps are still pretty jacked and starting to get defined again now that Im dieting and exercising.\n\nGet in the habit of exercising and DO NOT STOP ever!\n\nFinally, the few times i took mescaline were really amazing experiences with a lot of breakthroughs about life, reality and nature.  Its not for everyone but it was good for me.  If you are thinking about using psychedelics for improving creativity or getting to know your inner world, mescaline is the most gentle of the natural classical psychedelics (tryptamines and phenylethylamines).  In fact, I would stick to phenylethylamines in general since they are \"gentler.\" \n\nPS.  Take a multivitamin every day and drink lots of water. I take Optimen.\n","created_utc":"1404745122"}
{"body":"Short answer, yes it's safe. No you're not going to die.\n\nLong answer, it has GABA, although in a really small dose and it isn't in a form that can cross your blood brain barrier so it doesn't affect your GABA system too much. GABA is a slowing system in your brain, a brake. Many drugs such as alcohol and benzodiazepines bind to ion channel protein GABA-A's and therefore increase the amount of GABA in your brain. Too many drugs boosting your GABA levels can be fatal, but if you supply the GABA in the form it is in Alpha Brain, it isn't harmful. From a quick look on their web site, I don't see any other potential things to promote interaction with alcohol. Well, Vinpocetine is a vasodilator, as is alcohol with lower doses. You could feel orthostatic hypotension or other dizziness, but that is unlikely. Now I'm just drawing this too far. Just go and drink.","created_utc":"1321512444"}
{"body":"I shall have to look into that,I have very little in the way of empathy as is but it's still irritating sometimes along with other myriad emotions.\n\nI see what you are on about though,however I guess I cannot relate because I tend to have a very thick layer of superficial charm and joviality which lubricates the wheels of interaction.\n\nAnyway regarding your initial question the GABA system does seem to be a good target,but what about the opioid system?\n\nI mean anything GABA related has pretty pesky WD symptoms so if withdrawing isn't a problem then try that...also what about GBL?,in low doses ","created_utc":"1398983572"}
{"body":"So last night before I went to bed I took a little over a gram of GABA. I felt some pretty weird tingling/burning sensations in my limbs which I have never felt before... closest thing I could relate it to is a niacin flush without the... well, flush. \n\nI didn't really notice any sort of mental effect, but I did have a pretty terrifying sleep paralysis episode about an hour after going to bed. I was stuck in a loop where when I closed my eyes, a tooth would start vibrating, then wiggling, very painfully. Felt like someone was pushing down right in the middle of my face. \n\nThis is weird because I'm pretty familiar with the feeling of waking up and drifting back into REM sleep because I am an occasional lucid dreamer, but I never reach that point only an hour after bed, more like 4-5 hours. Also, this is the first time a sleep paralysis episode has been physically painful. I've always enjoyed the creepy vibe and weird hallucinations, being familiar with deliriant and hallucinogenic experiences. This time I had to get up for thirty minutes an do things to take my mind off the anxiety.\n\nI'm almost positive the tingling was the GABA, especially since after I experienced it I looked it up and others have corroborated the experience. The sleep paralysis I have no idea about... it has been a pretty crazy and anxiety-inducing day (started making plans to move and my brother got jumped) so I'm sure that could have contributed to the SP. I'm a bit worried that the correlation between taking GABA then having terrifying SP could be made in my brain though, meaning taking it could spike anxiety and effectively lead me to it again.\n\nHowever, the fact that the stomach has GABA receptors interests me because my anxiety does manifest itself physically in my gut like many others. I don't know the pharmacology of the GABA system well enough, though, so I guess further experimentation is necessary. It's fairly cheap stuff anyway.","created_utc":"1397766796"}
{"body":"They both works on the GABA system so technically speaking, they are both inhibitors...\n\nTheanine is the precursoe for GABA. It works by inhibiting anxiety and stress. Rhodiola works the same way by inhibiting monoamine oxidase. It is not recommended probably because you probably get an overload that result in a sleepy, sedated state to function properly. \n\nRhodiola also work on the sertonin and dopamine system to increase mood and fight depression. So I suppose you can take both, but in different quantity to avoid any problem. The body can only process certain level of a substance anyway. So the trick is finding the right mixture and balance. In fact, most cognition drinks and supplements aim specific at that goal. Most even go out and state it. I know AlphaBrain explicitly stated it. \n\n","created_utc":"1323094461"}
{"body":"I don't think so...\n\nCaffeine works on 3 systems: Adenosine, Adrenaline, and Dopamine. It inhibits Adenosine receptors (aka Adenosine is what make you feel sleepiness and relax. So stopping it means it you will be wake and alert). It creates adrenaline to make you hyperactive. Finally, it increase Dopamine (aka the fight or flight state as well as pleasure and arousal). \n\nPiracetam works on the ACH system with minor effect on GABA system. \n\nIf you are taking Nootropics that works on the similar 3 systems, then Yes it will caused any overload. Similar to taking double the caffeine dosage. However, because different drugs work differently, when you combined them, they also increase their effects on each other. So it won't be a double caffeine dosage, but like 5x its dosage depending on its synergy. \n\nAlphaBrain works on the GABA and Dopamine system. Just look at the ingredients, it tell ya everything. \n\n-Vinpocetine is a vasodilator (it increases blood flow)\n-GPC Choline is another name for Alpha-GPC which increase ACH in the brain\n-Mucuna create L-DOPA which turn into dopamine, adrenaline, or non-adrenaline\n-GABA is just GABA, it works on the GABA system to control mood and make you feel relax and calm\n-Vitamin Bs are energy sources for the cell as well an various benefits\n-Oat straw is also works on GABA system and an anti-anxiety substance\n-Bacopa is similar to Oat straw\n-Ptero is similar to resveratrol (found in grape) is an anti-oxidant and protect the cell from damage\n-AC-11 is similar to anti-oxidant, but protect the DNA from damage\n\nSo in short, AlphaBrain is a nootropic that focus on mood control, cells protection, and increase energy. ","created_utc":"1322965833"}
{"body":"You have A LOT of stimulants there...\n\nI am not a fan of stimulants. It has a funny way for speeding you up while shortening your overall lifespan. I personally that think it is worth the cost. I however do approved of natural stimulants found in foods and plants that you can eat. \n\nI notice that you might be a downer type who relay on stimulants to get up and out, but have you ever consider the alternative. By alternative, I meant inhibitors. Let me explain if you haven't already know about neurotransmitters and how they work. There are two types: one that fire/execute the action (aka excitor) or not fire/not perform the action (aka inhibitor). \n\nIf you feel down and out, you might have an overactive suppressor neuroactivity going on. By using stimulants, you are telling your body to fire more activities to override the what is causing you to be down and out. That result in overload of the senses because you have too much going on.\n\nMy solution is try inhibiting the down feeling instead of using stimulants. If those feeling down fire, you wouldn't feel them. There are many inhibitors depending on what you want to achieve. GABA system control the relax and main inhibitory activities. You list several that work on the GABA system in your \"Attack Dose\". But too much can lead to a down, sleepy state, too. \n\nThe trick is knowing what to turn off and what to turn on. Your body does it naturally by 1) your genetic coding and 2) your past lifestyle. One way to change your life is by taking supplements/drugs. Another way to simply NOT do what you do normal and do something else. Whatever your current actions lead to your current lifestyle, by changing it the actions, you can your state of mind and state of body. Think about it...","created_utc":"1322872859"}
{"body":"When I take my adderall, it gives the effect I want. At the right dose my surrounding are completely clear and I am more aware of my situation. I guess what I'm really looking for is situational awareness and clarity. So what noots affect the GABA system to these ends?","created_utc":"1323248510"}
{"body":"Wow, I thought what what you said and I had a 1 hour discussion to myself. It was endless. So I can write a 1000 words essay about long-term and short-term memory in a matter of minutes. Studying is another 1000 words essay by itself. So for the sake of conversation and simplicity, let stick to very specific topic with no intertwining topics.\n\nThe question is what nootropic is best for studying, right?\n\nAny racetam, pramiracetam is the best in my opinion. But it help to add a few other supplements for their special property. When you study, you're notorious for not focusing, especially for long period of time. Pramiracetam fixes that problem. You need a support of Pramiracetam, a choline source. So Alpha-GPC is the best choline. \n\nYou will also become tired and out of energy during studying. So you need a stimulant or energy booster to fix that problem. Caffeine is fine around 500mg a day, which is 5 cups of coffee in equivalent. Vitamin B is better because it help energize you at the mitochondria level. Sugar is notorious for crashes. Avoid it. \n\nYou also feeling tired and out of shape due to the long period of studying. So to fix that, do quick exercises that speed up blood flow and keep the body from slowing down. Also eating healthy foods and drink plenty of water to keep the body up to speed. No use having a focus and fast mind if the body is dying for rest and excitement. Take your multivitamins and protein shake. You need the amino acids. \n\nTaking quick naps recharge the mind and make learning easier. Better if you know how to enter REM and lucid dreams.\n\nTake some supplements on the GABA system to help you relax while focus. Phenylalanine, Tyrosine, or L-Dopa works. \n\nUse vasodilator like Vinpocetine or increase blood flow to provide more oxygen to the brain to allow better thinking like Picamilon. \n\nMost of studying come down to the techniques and motivations rather than a simple nootropic. Study in quiet environment with good background noise help. Use picture, rhyme, song, or story for studying, it makes it easier to recall them later. Avoid bad situations like arguments or relationship matter. Emotions are bad for studying. Use Q &amp; A game with a buddy help like playing Jeopardy. Use hierarchy learning style by simplifying large amount of information into simple sentence to outline to one word like how a book presented with title, outline, chapter, and full text information. When you can recall a several paragraphs worth of information from one word, you did well. \n\n","created_utc":"1323468619"}
{"body":"If 5 HTP has no effect, your depression might be dopamine related rather than serotonin. Try l-tyrosine. It is an amino acid that is a precursor to dopamine. As an amino acid, it is fairly safe, but I would cycle it if you plan to use it long term. Some people take it in the morning with a small amount of 5HTP in the afternoon. Some people also report increased focus on tyrosine.\n\nAlso want to second the people saying Magnesium. Fish oil. L-THEANINE. Of course, sleep, exercise, diet are your first line of defense on this stuff.\n\nAnxiety is tough to tackle since many anxiolytics target the GABA system which often leads to downregulation and more anxiety later. ","created_utc":"1504028076"}
{"body":"LOL, you pretty much are describing what most if not all Nootropics do there...\n\nTo answer your question, yes! And there are a lot out there. Dopamine is not about clarity or awareness by any means. Dopamine is the reward and pleasure neurotransmitter as well as the precursor for andrenaline and non-andrenline system. \n\nI don't think there is much Nootropics that DOESN'T affect the dopamine system in some shape or form. \n\nAwareness, clarity, and perception are not the same words. They all mean something totally different from one another. For perception, hallucinogenic is your best bet. DMT has to be the king of dream. \n\nFor clarity, you are basically controlling all emotions and thoughts. Inhibition is what you seek. So GABA system is your best bet. It control your mood and help you stay cool even in the hottest of situation, an effect we often refer to as nerve of steel.  \n\nFor awareness, well...it has several meanings so it depends. By awareness, do you mean the ability to react and find solutions to problems? Then the answer is speed. You want to react with precision and accuracy in the shortest time. Then stimulants are what you seek. ","created_utc":"1323069437"}
{"body":"Theanine is the precusor for GABA system which act like a relaxant, even sleepy. \n\nThe common combo is pair with caffeine to produce a focus yet calm feeling. ","created_utc":"1330305453"}
{"body":"From my experience and that of friends, it seems to help the most with people who already have anxiety and/or their GABA system is imbalanced. It helps me *a lot* but I've always run a bit hot with stress/anxiety issues..\n\nOf course, anxiety isn't always related to GABA","created_utc":"1322458728"}
{"body":"I know, it's very mild when compared to benzodiazepines or nonbenzodiazepines. These kind of drugs are not nootropics at all, so I just thought that a more subreddit relevant suggestion would be melatonin.\n\nSorry to hear that you've had negative experiences with it. Let's try to find you a healthier alternative to benzodiazepines! Have you tried phenibut or baclofen? They work through GABA system and have been [studied](http://onlinelibrary.wiley.com/store/10.1111/j.1527-3458.2001.tb00211.x/asset/j.1527-3458.2001.tb00211.x.pdf?v=1&amp;t=gou6zgfy&amp;s=f4d6fedba96a73d2845b7a0b3af613dba8797b9b) to work as mild tranquilizers.","created_utc":"1307895185"}
{"body":"True yet you will find many people on this subreddit recommending Theanine to people and on a regular dosage. Apparently, they are not aware it is a GABA.\n\nThe name is also confusing by referring to GABA (the supplement) and GABA (the system) by the same name. \n\nPersonally, GABA is not bad. It lacks the ability to enter the brain like phenibut and theanine. Thus, it only relax the body. I would use it after a workout or before bedtime. Using it during the day is counterproductive. However, because GABA is used by the body regularly anyway, a small amount or even a precursor like Glutamine will restore any GABA system deficiencies, which can be equally damaging as overload of GABA. ","created_utc":"1332825395"}
{"body":"Kava could be an option for you. It up-regulates GABA-A receptors. It actually sensitizes over time, rather than builds a tolerance.\n\nAshwagandha is an adaptopgen, and helps modulate your GABA system without building tolerance. It's nice to add in with stimulants to help regulate your adrenergic system.\n\nL-theanine is a go-to supplement. It's cheap and easy, and increases your natural GABA production in the brain.","created_utc":"1385766005"}
{"body":"I have access to dexedrine for about 8 years now. I never use more than 10-15 mg per day which is a tiny dose and I take many breaks. I never use more than 1.5 mg of clonazepam per day and it's only if I really need it. I alternate with other substance that work on the gaba system like theanine, lyrica and neurontin. I was really scared of clonazepam at first and that's why I asked for neurontin. It's end up that it's not that bad. Only people that don't want to fix the source of their anxiety that end up depending on it. I believe strongly in meditation and life change.","created_utc":"1327368151"}
{"body":"So the next logical question is:\n\nWhat happen when you take Piracetam with a GABA system acting agent like GABA and Phenibut at same time?\n\nIt goes back to the idea of excitory and inhibitory neurotransmitters. Despite Piracetam being a derivative of GABA, it functions totally different than that of GABA. ","created_utc":"1330217140"}
{"body":"One of the best experiences I have had where I felt my social anxiety pretty much entirely faded was when I made some [stem tea](http://www.thestonerscookbook.com/recipes/pot-stem-tea/). I store the stems from my buds in a stem jar and once in a blue moon I take all the stems, grind them up, then [decarboxylate](http://www.thestonerscookbook.com/decarboxylation/) them (important!) and boil them in half &amp; half. While the half &amp; half is cooking, I boil some water and prepare x cups of chai tea. Then fill in the enhanced half &amp; half, go to couch and enjoy my delicious drink.\n\nIn contrast to edibles, I find that drinks with CBD/THC have a much quicker onset and give you a much more relaxed high, kind of like a L-Theanine.\n\n\nOn your stutter: I think anti-convulsants can definitely help your stutter, try out Levetiracetam, but also give Piracetam, Phenylpiracetam and Aniracetam a shot. I think all of them can drastically improve verbal fluency, so just find the one that works best for you (there are some nootropic sites where you can buy sample packs, that may be a good idea for you).\n\nAnd some advice: Don't mess around with your GABA system - this is what a lot of anti-convulsants work on and these GABA drugs such as benzodiazepines, Phenibut, etc, are mostly highly addictive and make your anxiety worse than before you ever started.","created_utc":"1456442904"}
{"body":"The one that stands out are Ginkgo and Ginseng. But there are more into anti-depressant than anything else. Bacopa has protective properties.\n\nIn fact, your stack seem to be carter toward mentality focus and cognition than anti-anxiety. Mood changers is not the same as anti-anxiety. You have a combination of dopamine and choline precursors as well as MAOI. \n\nYour problem is the lack of anti-anxiety rather than which help with anxiety. \n\nTry GABA system precursor like Glutamine and Theanine. You need something to help you stay calm, cool-headed, and relax. Practicing Meditation helps.","created_utc":"1332027857"}
{"body":"The GABA system is a dangerous one. Tolerance builds quickly, and withdrawal can be very bad; life threatening even. If you want something safer in the GABAnergic space, kava would be safer.\n\nI'd move to a different system, or mix some substances. Bacopa would be good for the serotonin system. Kratom would be good as a mild opiate, but then you have to watch tolerance and addiction there as well.\n\nIf he is set on taking a substance to feel better, then he needs to cycle them. I'd suggest bacopa, kava, and kratom. All are cheap, legal, and easy to get. But he should look into some counseling if he is turning to substances for relief.","created_utc":"1362526451"}
{"body":"I'm not an expert in this field but yes, I would imagine the same could be said about Baclofen, Phenibut, Gabapentin, etc. It all depends on how often the drug is used though. Taking Phenibut 3 times a week won't cause you any significant damage whereas taking Phenibut for 3 months and then withdrawing quickly would give you some heavy excitotoxicity. As for drug-induced damage versus stress-induced damage goes I'm not sure. That's pretty up-in-the-air. We know stress is bad for the brain but we don't know exactly how bad. I really don't have any knowledge when it comes to this. When it comes to repairing damage I'm also not an expert but I can probably shed some light as I'm someone who has gone through benzo withdrawals and has talked to doctors and other people who have used benzos for long periods of time and stopped. There is definitely some degree of permanent damage but it's usually not debilitating. Alcohol and benzo withdrawal can take up to 2 years depending on the individual and the amount they took and how long they took it for. Time is the only thing that helps. The brain will slowly rebuild its endogenous GABA system and through a healthy lifestyle, one can hope that their brain fixes most of what was fucked up by the excitotoxicity. There really isn't any way that I know of to grow back these lost or damaged neurons but excessive glutamate during the withdrawal process can be attenuated by NMDA antagonists or anticonvulsants. If someone is going to use GABAergics for long periods of time (which isn't advisable) I would highly recommend adding some sort of safety net, whether it be Memantine or some anticonvulsant. ","created_utc":"1456615393"}
{"body":"&gt; dose daily for long periods of time\n\nAnd that's how people run into problems with phenibut and then it gets a bad rep. Beginners, don't listen to this guy.\n\nIt may be possible *depending on the person*. But then again I've met people who do heroin \"casually\" and never have any problems. So it's all very relative.\n\nWhat I mentioned is just a general rule. Once you get to know how the drug reacts with your own body you can play around with dosage and frequency at your own risk.\n\n&gt; the tolerance doesn't keep rising\n\nMe and plenty of other people have experienced phenibut to have one of the fastest increasing tolerances out of all GABAergics. Specially when used daily. Please don't spread around dangerously false facts. What works for you may not be the norm, and if you do your research on phenibut you'll find what you mentioned is *not* the norm.\n\nI just saw your other comment on this thread. Five grams, five days per week, is *definitely* not the norm. Most people would throw up and seriously fuck up with GABA system doing that. Kudos if you can pull it off without any negative side-effects.\n\n","created_utc":"1429821926"}
{"body":"Okay, so, for the sake of argument: would aniracetam be a bad idea with a downregulated GABA system and/or an upregulated glutaminergic system?","created_utc":"1430513449"}
{"body":"It has something to do with the GABA systems role in HGH production.\n\nWe know that both GBL/GBA and phenibut stimulate an increase in HGH production, which shows a causative relationship between the GABA system and HGH production. If I had to guess, exogenous HGH probably takes a bit of load off of the GABA system, but I really have no idea at all. I just know there's a relationship there.","created_utc":"1429282457"}
{"body":"Baclofen does nothing for my anxiety, but rather makes me extremely tired. I take 5mg when experiencing insomnia and wind up having the most amazing sleep. It does play on GABA system (GABA-B), so less is more unless you want to experience withdrawals. \n\nI use etizolam (GABA-A agonist) for acute anxiety, and very sparingly at that. Again, anything that touches the GABA system should be treated with the utmost respect.","created_utc":"1452274970"}
{"body":"Nah i'm saying you woould get a better \"feeling\" if you took a benzo (don't do that though). Phenibut is by it's very design not supposed to be felt, that is why it was used on the space program. They also send up stronger traquilisers\\anti anxiety but phenibut does not have anywhere near as strong negative (which most users think positive) effects.\n\nBasically phenibut is like 2% beer. 750 mg is the maximum one time dose and it shows potential liver toxicity in long term uses. You could say maybe long term use points to high dose doing the same damage but who knows?\n\nPeople who I suspect are benzo naive love it just like if you gave a 5 year old a pint of 2% beer they would probably get drunk. Watching people take massive doses for light effect whist still screwing their GABA system is a pet peeve of mine about this sub.","created_utc":"1460450403"}
{"body":"Very interesting! I wasn't aware of that pathway.\n\nI can't remember whether I was supplementing MK-677 after my highest phenibut dose, but that may have been part of what was causing the anxiety and depression I was feeling for a week after a single 2g dose, since it stimulates endogenous release and probably taxes the GABA system more.","created_utc":"1429282813"}
{"body":"Overactivation that leads to cell death yes.But this one is more likely when GABA system is suppresed (like in benzo withdrawal) or very strong poison is used.","created_utc":"1452424874"}
{"body":"Homeostasis: Your body reacts to artificial inputs and down\\upregulates receptors accordingly. When you stop using those receptors are still there and screaming for more.\n\nThings that work on the GABA system are the worst and can take a very long time to recover. Benzo's (where phenibut roughly sits at the week end of the scale) can take 2 years to return to normal. Opiates a week or two (for pure physical symptoms) etc.\n\nTANSTAAFL","created_utc":"1451219404"}
{"body":"If you just have a few presentations then both ashwagandha (dose like  1g), and phenibut (also 1g) are great for anxiety.\n\n Phenibut can only be taken once  every  1-2 weeks but it gives amazing calmness and lack of anxiety without tiredness. Great if you only seldomly have presentations.\n\nI never found ashwagandha to make me tired, for me it gave me more energy. It depends on brain chemistry and how your GABA system works. I suggest you cycle ashwagandha though, taking it  once every few days or one week on and one week off. It stopped working for me just a few weeks in when I didn't cycle it. \n\nI personally don't experience less anxiety on Theanine. It only takes the overstimulation off of stimulants for me, and maybe gives a bit of focus. \n","created_utc":"1423363551"}
{"body":"My latest Magic formula - 6.5g of some energetic vein Kratom with grapefruit juice in the morning, cup of coffe with MTC at around 13:00 and than second Kratom drink around 16:30.\n\nEdit: btw ... Taurine actually works on GABA system so, at least for me, it makes me feel little sedated therefore I wouldn't recommend it as part of energy stack. (Tried this many times and it always made me feel this way)","created_utc":"1428063634"}
{"body":"Interesting. Did you try high-quality theanine at a 2:1 ratio? That's what it takes for me to see a strong effect. 1:1 is noticeable but not really very helpful. And combining L-theanine with coffee is completely useless for me - I have to use caffeine pills + L-theanine.\n\nIs there some reason that your GABA system might just be screwy, either because of individual biochemistry or e.g. long-term benzodiazepine/phenibut/alcohol use?","created_utc":"1431004031"}
{"body":"I switched from phenibut to baclofen and taper down the baclofen to nothing no problem. I believe these additions helped me: Fasoracetam (supposed to up regulate the GABA-B receptors) and Beta-Alanine (saw another post on here about how this helped. A search should turn it up. Not sure why it works but it does). Also Memantine to stop glutamate in its tracks while GABA system is adjusting. Lastly, pregabalin (Lyrica) every few days. Whenever I took phenibut daily, I could take pregabalin instead of phenibut for the day and be fine. In a rush, so can't look up exact science, but something about the same calcium channels. Was careful never to take pregabalin more than twice a week because did not want to gain a new dependency.\n\nI was on phenibut daily for 2 years and got off completely with the help of baclofen in 2-3 weeks. Feel absolutely fine. Unlike benzo withdrawal hell.\n","created_utc":"1447904925"}
{"body":"(Just talking about excitotoxicity) \nWhen a GABAergic is removed from the body there is an influx if glutamate that can cause excitotoxicity. This isn't damaging over the short term (drinking, taking the occasional benzo) but people using alcohol or benzos for months on end are going to experience quite a bit of damage.  \n\n Let's say someone is on benzos for a year. Their brain is completely reliant on the benzo as its inhibitory mechanism as the endogenous GABA system has been replaced by the drug. Every time that person misses a dose by an hour or so they'll experience large amounts of excitotoxicity as the brain no longer has its own inhibitory network. Over time these bursts of excitotoxicity lead to heavy brain damage. This is called kindling. It's far more common in alcoholics because they don't necessarily 'schedule' their drinks. When the booze wears off, their brain goes on the fritz with a glutamate storm. This is why benzo and alcohol withdrawals are so dangerous and damaging compared to opiate withdrawals. This is thought to be why benzos are physically damaging to the brain over the long term. It's not the drugs themselves causing the damage but the excess glutamatergic transmission that occurs when the drug is removed ","created_utc":"1456610036"}
{"body":"I'm sorry. I think your right. I am replying from my phone and I think I sort of grouped you as all the people replying. \n\nI posted stuff a week ago about cacao effects and people kept sort of saying I'm being sketchy with Rhodiola and cacao. And then I tried to point out its not really regular Rhodiola or even Rhodiola necessarily. And it was like people keep ignoring vital facts about what I'm trying to figure out. Like I sort of posted this because people were thinking I'm stupid for mixing MAOI with Mirtazapine. But I suspected it's NOT an MAOI. And the guy posted here too saying its Mirtazapine that will effect me. I assumed it was you. I'm sorry. \n\nThen the guy who was making me out to seem sketch came to this post and said the same stuff. And  then I saw how you posted on my Faso post and for some reason I thought you were the same person. \n\nThen I thought the guy is liked pissed and following my posts to disagree with them lol. Like maybe he thinks I'm far too risky in general or got mad because I mention psychedelics at times and since those are \"bad\" drugs idk. \n\nFaso is what I was on. Usually I'm on vyvanse. Funny I'm usually not as aggressive but still somewhat. Faso I was purposely trying to get withdrawals from it. So I could balance out my GABA system a little. Since New Years alcohol set me off to a kind of mental illness. This worked btw. :)","created_utc":"1453136943"}
{"body":"I microdose piracetam, and it works for me.  I believe that a fluoroquinolone antibiotic wrecked some aspect of my GABA system in 2001, and it's still not right.  When I first took piracetam (back in the early '90s after reading a Mondo 2000 article), I tried an attack dose of 2.4g and got minor but noticeable effects like enhanced music appreciation and slightly deeper thinking, which continued to occur with subsequent doses of 800mg.  I get that same type of effect from less than a microscoop now.  I wouldn't suggest that anyone take fluoroquinolone antibiotics for this or any other reason.  But since the specific question today was about dosage and effect of piracetam, I thought I'd risk telling my weird story and opening the door for trolls to gleefully rip my flesh from my bones. Or, for non-trolls to enjoy a new and curious data point.","created_utc":"1442001781"}
{"body":"I was thinking more-so as a standalone supplement... I don't personally drink, but that's not to say I don't play with my GABA system here and there (and everywhere)","created_utc":"1447134493"}
{"body":"IMO although absorption is definitely a factor, there's also the sensitivity of your GABA receptors. I used to date this French girl, I gave her phenibut once. One gram for her, 1.25g for me. I was fine, but she got dizzy and blacked out. I think it's really that her GABA system was more sensitive than mine. She had a low tolerance for alcohol too, even though she drank regularly. What's more, she was always very relaxed despite an extremely demanding job and she could fall asleep in minutes every time. She was one of those super extroverted people who never worry about anything... The kind of person who never needed alcohol or phenibut to begin with.\n\nWrt waiting 2.5 hours, I'd actually wait 4. That's how long it takes me to reach the \"peak\" of a phenibut high. 1g to 1.5g is enough to get me pretty altered. 2.5g will make it hard for me to walk. I weigh 137 pounds.","created_utc":"1426454262"}
{"body":"Ashwagandha and green tea would be two good ones to add, I tend to be most responsive to changes in the GABA system as well","created_utc":"1424987970"}
{"body":"Yes but they are addictive and tolerance builds fast and therfore they are not sustainable, would not recommend but you are looking for things acting in GABA system ","created_utc":"1444242929"}
{"body":"&gt;  I still don't think he did the right thing as he didn't comment on weening off of it at all. \n\n**He deserves to be fired from his practice.** Any credible psychiatrist would lay out a titrating plan for your benzos, and make sure you abide by it. *D.T. and seizures are no joke.*\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nHere's some SUPER effective botanicals for benzo-related withdrawal symptoms:\n\n**Daytime:**\n\nAshwagandha (extract) + Gotu Kola (extract) + Skullcap (extract, and only during the day on the *rough* days) \n\n*edit*: it would also be good to take ashwagandha in an encapsulated powder form too, just to bolster the effect. It's really fantastic for getting your GABA system operating at a more normalized level.\n\n**Afternoon:**\n\nHoly Basil (leaf) + Rosemary (leaf) + Lemon Balm (leaf) tea infused with California Poppy (extract), optional Green Tea (but that depends on whether you prefer caffeine or not)\n\n**Night:** \n\nLemongrass (leaf) + Skullcap (leaf) + Chamomile (flower) tea infused with Lavender (extract) + Skullcap (extract) + Chamomile (extract) + Hops (extract)\n\nThis is from personal experience with many benzo WDs and bad psychiatrists, too. I had to find out what compounds worked best because I could never properly titrate down on my own.\n\nMany of those herbs' constituents actually bind to benzo receptors themselves. \n\nOthers interact with GABA//have GABAergic properties.\n\nAnother option for you, if you can't kick the final withdrawal symptoms, is [Melissa Supreme](http://smile.amazon.com/Melissa-Supreme-Alchohol-Gaia-Herbs/dp/B000Z8Z03Y/ref=sr_1_1?ie=UTF8&amp;qid=1442437329&amp;sr=8-1&amp;keywords=melissa+supreme) - It's like nature's benzo. But it actually improves cognition, rather than hindering it. It's a cocktail of extracts of anxiolytic herbs. Honestly it's the most effective natural extract I've ever had, and I was using it for benzo withdrawal. It will also help you get better sleep since you're taking adrafinil and NA-Semax Amidate.\n\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\nHope that helps.\n\nAnd thank you too, we're all friends here (as long as we contribute)!\n\n\n*edit*: Nice stack, btw :) I hope I contributed, somewhat; I know I've had a popular testimonial here and there for NA-Semax-Amidate. ","created_utc":"1442437427"}
{"body":"Alpha lipoic acid is the best. Dat glutathione kicks the ass off hangover toxins.\n\nJust whatever you do, **don't use these detoxifiers as an excuse to binge drink more often.** I did that and it did me no good. Your GABA system still adapts and you will get addicted and destitute.","created_utc":"1432943733"}
{"body":"You may be right. I guessed it was just based on the effects it has on me. From a quick search it looks like there isn't many studies that show exactly what its effect on the GABA system is. It could be a GABA mimetic but it is definitely affecting it somehow.","created_utc":"1441750129"}
{"body":"If you're taking pregabalin for managing Epilepsy/Sizures, You better not to take racetams with it!\nFight the excess sedations with regular exercise.\n\nEDIT: Because your brain is already overly active which pregabalin modulates GABA system (Inhibitory System) to prevent sudden Glutamate (Stimulatory System) storms aka Sizure. And most racetams are NMDA receptor's allosteric modulators which enhance Glutamate. \nYou'd better ask your doctor for something to lift your mood and motivation.\n\nGood lucks","created_utc":"1461116851"}
{"body":"I would also agree that SSRI's are not much of solution. \n\nAs for L-Theanine, it works on GABA system not Serotonine so it shouldn't add up to risk of Serotonine Syndrome.","created_utc":"1438349037"}
{"body":"I don't see where there's evidence for ashwagandha needing to be cycled? It's not like it's an agonist at GABA receptors causing down regulation, it enhances GABAergic signalling, probably doesn't cause down regulation so cycling seems unnecessary. That thread seems to have a bizarre view of GABAergics, not everything acting on the GABA system causes down regulation.","created_utc":"1427628534"}
{"body":"[Ncbi is bae](http://www.ncbi.nlm.nih.gov/pubmed/11849830). Can't help explain the mechanism because my knowledge is limited in that area. \n\nIs this effect limited to Arg+GABA or would we see similar results with Arg+X? If the former only, how about structural analogues? Also, would Arg alternatives that are more effective at boosting NO share this effect? \n\nI don't f with my GABA system on the reg so I can't offer any personal experiences. If this works for you, keep it under your hat so it doesn't get out to all those *other* forums :)","created_utc":"1445795502"}
{"body":"Yes but that still doesn't negate the fact that is acts on the GABA system ","created_utc":"1445613894"}
{"body":"&gt; Do you know why there is the recommended maximum of 8-12 weeks? Was tolerance noticed around that time-frame?\n\nIt is the recommended dosage regime and likely due to effects on GABA system the best time to stop without going into tolerence\\dependency. That is my assumption though and benzo's are generally prescribed short term only outside of the U.S","created_utc":"1460494856"}
{"body":"&gt; Ashwagandha Extract (2.5% Withanolides) - this is my first time ever taking Ashwagandha. The dosage recommendation says \"is 500 mg, taken 2-3 times per day with meals or water.\" Would you agree with this? Also, is Ashwagandha safe to take with the rest of my stack?\n\nYes. It's safe for almost everyone, with minimal bad interactions. Just remember to cycle ashwagandha.\n\n1 week on 1 week off. Or Every other day. Or just mon - Thursday. Something like that.\n\nThe reason is you don't want to overtax the gaba system and you want the ashwaganda to not build up tolerance.\n","created_utc":"1437249639"}
{"body":"Mindfulness meditation! It's called Vipassanna and its a specific way to focus on your breath. Once achieved it enhances your awareness and puts you in control of your thought process volitionally. Several others in this thread have recommended it and I whole heartedly agree. And its a very convenient way to meditate, you don't need to set aside time to sit, you do it whenever you want (although sitting for 15min here or there definitely speed up the learning process).\n\nAlso do be careful with phenebut. It really does a number on the GABA system and I've heard many accounts of dangerous withdrawals and high tolerance issues. Definitely taper as well. Also I want to suggest to cut back drastically on the drinking. I'm not trying to be on a high horse or be judgmental, Im speaking from a perspective of giving you the information you're requesting and I know for a fact you'll feel better without it.  Its one of the most harmful substances for someone who's seeking harmony.\n\nAlso consider looking into a ketogenic diet. I've been on one for 2 years and not only did I lose 120lbs but I have never had a clearer or more effective mind. Its just a low carb diet to get you off of glucose as your primary fuel source and onto ketones. There's more benefits to that diet than I care to list out so definitely google it up. But if you have any questions feel free to ask!  Best of luck to you man and take care of yourself!","created_utc":"1432778000"}
{"body":"&gt; When you're on Phenibut..... you act like a retard\n\nPhenibut lowers your inhibition, potentially to a point where you have no filter between your thoughts, and your words/actions. Similar to the way alcohol affected people do dumb things, as both Phenibut and alcohol target GABA receptors.\nOne way to control this is to reduce the amount of Phenibut you take. You say you need at least 2 grams to \"feel\" the effects, but you shouldn't be able to \"feel\" the drug at a therapeutic dose, all you would notice is an absence of anxiety in a situation that would normally provoke it.\n\n&gt; took it three days in a row\n\n&gt; today I feel really anxious, and for no reason at all\n\nWell, there is a reason - you dun goofed. Recommendations for Phenibut use always state a maximum of 2 times per week, and never on consecutive days. You were fucking with your GABA system for an extended period of time without allowing it to recover to homeostasis, so the brain overcompensates and adjusts the levels of neurotransmitters. This is the cause of your rebound anxiety. It should pass shortly, you may find one or maybe two beers helps. \n\nIn future I'd recommend doing some basic research on drugs before ingesting them, *especially* if you plan on disregarding the dosage guidelines.","created_utc":"1430846442"}
{"body":"See:\n\n[Don't worry ‘B’ happy!: a role for GABAB receptors in anxiety and depression (2005)](http://www.sciencedirect.com/science/article/pii/S0165614704003104)\n\n&gt;GABA, the main inhibitory neurotransmitter in the brain, regulates many physiological and psychological processes. Thus, dysfunction of the GABA system is implicated in the pathophysiology of several neuropsychiatric disorders, including anxiety and depression. However, the role of GABAB receptors in behavioural processes related to these disorders has not been resolved. GABAB receptors are G-protein-coupled receptors that function as heterodimers of GABAB(1) and GABAB(2) subunits. In addition to highly selective agonists and antagonists, novel GABAB receptor tools have been developed recently to further assist elucidation of the role of GABAB receptors in CNS function. These include mice that lack functional GABAB receptors, and novel positive modulators of the GABAB receptor. In this review, we discuss evidence that points to a role of GABAB receptors in anxiety and depression.","created_utc":"1454659238"}
{"body":"ash works on gaba system doesnt it?\n\ni would think that they potentiate each other well","created_utc":"1462030114"}
{"body":"I started with 600mg about 2hrs before my desired bed time (ex: I take it at midnight to sleep at 2am). I'm at 900mg now with a staggered dose - 600mg at 2hrs before bed, 300mg at bedtime.\n\nI've always had a messed up gaba system though, so your mileage may vary.","created_utc":"1435630812"}
{"body":"Just to point out something gentlemen: GABA-a subreceptors have properties that can do five main things. One of those things is ameliorate anxiety, just because it's an inverse agonist at some subreceptors, but a full agonist at other receptors doesn't mean it's anxiogenic. \nIt may be, but there are lines drawn in the GABA system and they may have blockaded that portion out. We are doing that nowadays with the entire GABA complex. \n\nI present to you Bretanezil as a step forward in the BZD subcomplex. We can do better. We can have a powerful anxiolytic bereft of the undesirable affects of the Oh's, GHB.s, Benzos, Quaalones, the Z class and the barbs.\n\nWe just have to map the complex better and build better ligands.\n\n","created_utc":"1372841374"}
{"body":"I'd be far more worried about renal failure and liver damages from these dosages. \n\nI wouldn't imagine that his GABA system is any more wrecked that a severe alcoholic's. Very messed up, but it could be worse.","created_utc":"1425344719"}
{"body":"Don't see why memantine would be a problem with your stack. As /u/cobue says below, start *low* 5mg every other day at the most for a week then slowly titrate up to 10 mg and potentially 20 mg depending how you like it. \n\nThough having said that I experienced no brain fog with memantine when I took between 5-10mg every day for a few days then just went to 10mg, but it isn't fun if you do.\n\nAs for phenibut... I don't see why you couldn't take your stack with it. There may be enzymatic interactions with bacopa or something like that. I'm not sure we know how phenibut is metabolised so I can't say for sure. I've taken phenibut on days where i've taken whatever my stack is for that day and haven't experienced any issues. Again, none of your stack targets the GABA receptors as agonists and so should not potentiate it much. Ashwagandha enhances GABA-A signalling long-term but not GABA-B and phenibut only binds to GABA-A at higher doses so I'm not sure it'd be a concern. \n\nAlpha-GPC and l-theanine have no or little effect on the GABA system so they shouldn't be a problem, though taking l-theanine at the same time as phenibut would be kinda pointless. Aniracetam doesn't have much of a direct effect on GABA either. ","created_utc":"1426021759"}
{"body":"I understand the reason beer works so well is the same Phenibut works amazingly well for me, and generally any gabagernic.\n\nThere's some thought about the fact that neurononal threshold firing is disfigured in ADHDrs, so they either fire TOO much or not ENOUGH.\n\nAsfar as I am aware, gaba system modulates this which in the end made the neurons more 'modulated'  and 'restfull' \n\nBut I do not have any direct research on this, I believe there was a a post about this on bluecity or longicity.\n\nSmth with too sensitive to Glutamate, or too much Glutamate in general.\n\nIt helped with mood, being overly hyperactive and indirect with concentration thus. \n\n'","created_utc":"1431510535"}
{"body":"That's ok, I made a similar mistake once..  take care of yourself.  titrate your dosage down, don't try to go cold on it.  then take it responsibly.  If you find yourself unable to do so, noops (drugs) may not be for you.\n\nDon't play with the GABA system too much if you can avoid it, ask any alcoholic, it's a road to hell.  ","created_utc":"1437183835"}
{"body":"I have, out of necessity, been reading extensively on sleep regulation and supplements. I have to say it is an incredibly complex problem, once some sort of dis-regulation occurs. Like /u/Jackolysis says, melatonin in very small amounts may be helpful; most people attempt melatonin in much higher amounts and have adverse effects as a result. Melatonin affects the circadian rhythm cycle.  \n\nThe common prescribed sleep inducing drugs, such as Zolpidem or Zopiclone work on GABA A receptors. Phenibut works on GABA B. Pretty much anything involving the GABA system can get risky in terms of addiction and altering GABA regulation pretty fast, so be careful of these (most people would also state they are not nootropics). \n\nAntihistamines (like Benadryl) also have negatives such as tolerance and addiction, but work by affecting histamine in the brain; Histamines are associated with the state of wakefulness/alertness.\n\nNow, this is not really addressing your original question but I think it gets to the point that there are a lot of interdependencies in the sleep/wakefulness system that a) scientists are barely unraveling now and b) make finding a solution that doesn't upset the apple cart somewhere else very difficult.\n\nOther things you could look into: Valerian root, chamomille, passionflower, hops... \n","created_utc":"1428614650"}
{"body":"Hi, I'm the OP of the post you have quoted!\n\nAs to the question whether stimulants can or cannot cause sensitization, it's been proven that they can.\n\n[Rhesus monkeys that were given very low doses of Amphetamine showed an amplified response to a normal Amphetamine dose 5 days after the single dose, as well as 28 months (2.5 years) after the single dose, in comparison to the control group](http://www.nature.com/npp/journal/v20/n1/full/1395233a.html).\n\nThis study has demonstrated that sensitization can occur from a single administration of a very low dose of Amphetamine, and this sensitization appears to be permanent (persisted for 2.5+ years). This is speculated to work like that since very low doses of Amphetamine inhibit monoamine release instead of enhancing it, so pre-synaptic dopaminergic receptors over-compensate for it by increasing both the amount of Dopamine being produced and the amount being released.\n\nSensitization to stimulants is a common phenomenon and can occur after just one very low dose. One low dose, that's all that is required to induce sensitization, as demonstrated in rhesus monkeys and rats.\n\nDrugs that act on GABAergic pathways show a similar mechanism. Ever wondered why drinking a little bit of Alcohol stimulates you, but drinking more puts you down? Alcohol acts as a stimulant in low doses and as a depressant in high doses. This is because low doses of Alcohol negatively modulate the sensitivity of GABA receptors, meaning GABA has less effects. Higher doses, though, positively modulate the sensitivity of GABA receptors, meaning GABA molecules have more effects. \n\nThat being said, it's not completely sure whether the GABA system can become sensitized like the dopamine system can. Dopaminergic neurons are very prone to sensitization for evolutionary reasons - when a new reward is learned, the dopamine system is nearly permanently sensitized. It's not sure whether the GABA system works in a similar way.\n\nAnd yes, taking 10mg of Adderall and experiencing symptoms of an overdose is a sign of sensitization to Adderall. I had become sensitized to Methylphenidate after taking 5mg one day and it's terrible. I personally found that it's very long lasting (it's been 8 months and I'm still sensitized) and the only solution is to avoid Methylphenidate, mainly because I'm not sure if it'll ever pass.\n\nIf you have any questions about the subject, I'll be more than glad to answer and discuss with you. I'm eager about studying this subject of sensitization and Hormesis in low doses, so if you have any experiences or questions about this to share I'll be happy to listen.","created_utc":"1437694573"}
{"body":"One thing that helped me a ton with the blowback from dosing phenibut is sulbutiamine and noopept. It's a great combination that works at full potency for about 3 days, which is generally enough time for the brain to readjust after such a world-rocking.\n\nBut if you already have a GABA problem in your head naturally, I'm sorry to say, but phenibut is risking major consequences for an effect that is offset with amplified side effects. The GABA system is responsible for keeping your brain from killing itself: this is why it is so rigidly regulated and why messing with it for any length of time will incite major countermeasures. Phenibut has the longest length of action of any GABAdic drug I know of, and that is the main thing that makes it so dangerous.\n\nHonestly, it would pay to try and make a *shorter-acting* form of phenibut, if a person could. I think Phenibut F.A.A. has a shorter action (it also can be absorbed sublingually due to the higher pH). You might want to look into F.A.A. if you really must continue with the phenibut.\n\nJust remember that things aren't always fair: I can't drink anymore because it makes me stupid, and with this in mind I only take phenibut once every month-and-a-half or so, because I don't trust myself to mess with GABA any more than that. It sounds like you have a sensitive system that isn't very balanced to begin with, and phenibut is anything but an attempt at balance. I think you would be happier in the long run severely limiting your use, perhaps to every two months, although I think you'd be happiest not messing with it at all.","created_utc":"1429788954"}
{"body":"OK, this subreddit seriously needs substance-specific FAQs for the most common substances (piracetam, modafinil and its variants, phenibut, ...)\n\nThese kinds of threads keep popping up. And the same thing happens every time. Some people proclaim it's a wonder drug, other people give ridiculously overcautious advice. Yes, this stuff is fucking great, yes, this stuff is fucking addictive, and yes, you can use it with regularity without getting addicted or sick or anything like that. But you have to do it right, by treating the drug with respect and following proper procedure. Here's how you do that:\n\n1. Find a trusted source. This is not a problem for phenibut, many vendors sell this stuff pure with a third-party CoA. You won't be getting bath salts when you order phenibut.\n2. Do an allergy test with a tiny dose. This is, assuming you followed rule #1, not really necessary with phenibut, since it is a very close analogue of an endogenous neurotransmitter and there are no reports of its being toxic or allergenic. You'd probably be dead if you were allergic to phenibut, as your GABA system would be unable to function if it couldn't handle such a close analogue.\n3. Do research and figure out the acceptable dosage range. Contrary to what other people here say, I would say the acceptable dosage range is 500-3000mg. For some, the lower end will be way too little, for others, the high end will be way too much. Higher-end doses are more recreational, lower-end doses more functional. Plan your day accordingly. Phenibut has no known toxic dose, so you can take much more without dying, but you will become ill or dependent or both, so just don't. But stay in this dosage range, and you'll be safe.\n4. Do more research and figure out how often you can take the stuff without becoming addicted, developing a tolerance, or doing damage to your brain. For phenibut, this is no more than one time per week, i.e., seven days between each use, preferably more. You could probably get away with six days, maybe even five, but seven is a cautious but not overcautious estimate.\n5. Titrate! Find the dose that works best *for you*. This means starting at the lower end of the dosage range and gauging the effects. If you are worried or unusually sensitive to similar drugs (alcohol, benzos, etc) start with 500 mg. If you think you can handle a bit more, you can start with 1000mg or even 1500mg. If you take too much, you will feel a bit ill but no worse than an alcohol hangover. If you are not satisfied with the effects, wait the required amount of time (about a week) and then up the dose by 500mg. By this point, your research should have indicated to you that it takes 3-4 hours to take full effect, so DO NOT redose until this much time has elapsed. Ideally, don't redose at all, just wait until tolerance resets and try a higher dose next time.\n6. Once you find a dose that gives you good effects and does not give you undesirable side effects, stick with it. Don't go higher. If you find yourself hitting 3+ grams and still aren't satisfied, or you find even lower doses have an unsatisfactory ratio of side effects to desirable effects, phenibut is not for you. Don't go higher.\n7. Be aware of duration and afterglow/hangover effects too. Lately I've been experiencing some uncomfortable sedation the next day from my usual dose, which is a sign I may be taking too much and need to dial it down. This can happen even if you've been fine taking the same dose for a long time.\n8. It goes without saying, but don't operate heavy machinery etc, until you know how the drug and dose affect you. Heavier doses can be a lot like being drunk, although generally the headspace is clearer and motor control is better.\n9. Once you have the dose, stick with your schedule, track your use somehow, and never fall for the temptation to break your schedule. Ever. Twice a week will turn into three times and then every day before you know it. I have zero problems staying w/ once-a-week usage, and do not experience any loss in potency or withdrawal effects from this regimen. But I don't trust myself with using more often. This stuff is very physically addictive, that much is true, but you *can* use it regularly as long as your frequency is appropriate.\n10. It *can* be combined with alcohol, but only if you follow these exact guidelines. I.e., start with very small doses of each and gauge the effects. Titrate up slowly. Do it in a safe environment. Don't do it often. It *will* potentiate the effects of alcohol. Personally I advice against it, but if you're going to do it, do it cautiously and responsibly.\n\nNotice a theme here? Be responsible! Exercise caution! Apply common sense and a quasi-scientific (quasi because it is too subjective to be called properly scientific) methodology. If you notice signs of addiction, step down your usage. If you notice uncomfortable side effects, step down your usage. That's all there is to it. You won't die, you won't turn into a zombie or a junkie if you follow these guidelines.","created_utc":"1370533137"}
{"body":"In my experience stimulant addiction is not a simple thing and I'm not sure how many people can even develop it. It's very different from opiate addiction that is very straightforward and simple. Sure we are dopamine seeking machines, but stimulants don't really provide dopamine rush equal to opiates and they have many side effects if abused for high. Also, stimulants don't activate endorphin reward system and thus it's impossible to get physically addicted like opiates, neither they do activate GABA system known to cause different kind of physical addiction. I have used MPH daily for months and then have taken break that lasted months with only symptoms of \"withdrawal\" being tiredness for few days after stopping. I also think chasing the high (whether it's stimulant or opiate, you're chasing dopamine in both cases and I'd argue stimulant addicts would be much better abusing opiates, safer that way even though just as stupid) is not symptom of using the drug. In my experience it's more quality of life and mental issue, usually triggered by depression. People who understand that getting high on life is much better than anything drugs can provide (way more dopamine in the long run) don't need to chase the high with stimulants, but can benefit from medical doses because it allows them to use their brain more efficiently and thus get high on life (not the drug) much better. \n\nI'm sorry MPH was such a bad drug for you, but we each have our own brain and effects are drugs can be very subjective. There are tons of people who greatly benefit from using MPH, even if it was drug from hell to you. Also wasn't it good thing that you ended up abusing MPH rather than amphetamines? Those things can give real brain damage equal to parkinsonism when abused. MPH on the otherhand has been excessively studied and seems to cause much less damage if any.","created_utc":"1435134173"}
{"body":"I think it's because different people metabolize phenibut at different rates, and different people probably have more or less fast GABA up/downregulation. I can tell you that I took phenibut twice this week, 2 x 1.5g. I feel fine mood-wise and anxiety-wise, but I've had bad insomnia the last two nights which seems to be the result of this recent phenibut use.\n\nI think my GABA system has downregulated and it's making it impossible for my brain to sleep unless extremely tired. I basically feel way more awake than normal. Way more awake than I should be with the amount of sleep I got in the last 72 hours. My sleep schedule is all fucked up. I'm about to go get some sleep now, and it's 9:52AM. I'll try avoiding this drug and other GABAergics for the next 2-3 weeks at least.","created_utc":"1423752749"}
{"body":"Yea I hear ya. I would just be concerned about dependence, and tolerance. Gaba system goes through pharmacological adaption a lot, and therefor benzos effects may diminish, leaving him/her with worse anxiety and untreated depression.\n\nI guess Its a very black/white situation.","created_utc":"1445535561"}
{"body":"Baclofen should not elicit tolerance with nearly the promptness of Phenibut.\n\nThe major reason for this is the large disparity in lengths of effect; Baclofen has a half-life of 3-4 hours. The GABA system is much more prone to take adaptive measures in the face of long-term manipulation, such as the 30+ hour effects of Phenibut.\n\nNot that you shouldn't still be careful as hell with the GABA system, but Baclofen is definitely safer, from what I understand of it.","created_utc":"1434809673"}
{"body":"&gt; For longjack I'm not sure, it's this one: http://www.powdercity.com/products/tongkat-ali-eurycomanone\n\nLooks great.\n\n&gt; Also, when you say things that have helped you the most are you saying in general?\n\nWith Libido specifically. Those 6 powders listed. Though they have other benefits as well obviously. \n\n&gt; I have just started taking Omega-3 Fish Oil about 15 minutes before I take Aniracetam in order for the Aniracetam to be absorbed well into the bloodstream. Is this just bs or should I continue doing this?\n\nI have no idea. You should research that question on longecity, using a google search with the appropriate terms plus the word longecity. Warning, take what you read there with a grain of salt. Lots of people trying to be smart and may end up with inaccuracies from time to time. \n\n&gt; I also forgot to say that I have Alpha-GPC 50% for the supposed racetam headaches, but I haven't gotten them. Whenever I feel like I'm starting to, I just eat some eggs and I feel fine. Should I include it to my stack? I have hesitated because of experiences I read online where the person felt noticeably worse whenever they weren't taking it.\n\nAlpha GPC is a curious thing. People have reported feeling depressed while on it. But they are the vast minority. Pay attention to your mind and body with the utmost vigilance. Odds are you will respond fine to Alpha GPC. but play around with small, medium and normal doses. See how you feel.\n\nWere you aware of the power increase with lifting it gives you at the correct dose? Pretty remarkable.\n\nIt's good that the Aniracetam does not give you headaches. The Alpha GPC is not just for the racetam headaches, it's a nootropic in it's own right ( in addition to it;s increase for power lifting ) and may enhance the nootropic effect of racetams whether they give you a headache or not. Eggs are always good.\n\nNOW. As far as the ashwaganda question which was also refered to by /u/enedhwaith , its a tricky one.\n\nPersonally, I hate taking it everyday for weeks on end. It started to give me anxiety and almost a depersonalization effect. This was after taking it every day for 2 1/2 months. \n\nIt's a medicine that has hundreds of years of use in thraditional ayurveyda. And it is there that people decided to take it for a few days then cycle of it for a while. Not intended for chronic use like Reishi or astragalus.\n\nScience came along and some say that ashwaghanda taxes the gaba system and therefore should not be used everyday for long periods of time. Seemingly backing up Ayurveda. \n\nNow some people say this is bullshit. \n\nA definitive answer has not been found yet. Or maybe it has?\n\nhttp://www.longecity.org/forum/topic/55055-ashwagandha-tolerance-or-withdrawal/","created_utc":"1442331802"}
{"body":"Jesus, dude. Your GABA system must be absolutely *wrecked*.\n\nGodspeed.","created_utc":"1425324597"}
{"body":"View this image &gt;\n\nhttps://neuroendoimmune.files.wordpress.com/2013/07/gaba-glutamate-synthesis.png\n\nGlutamine can definitely cause anxiety or assist it, it depends on the balance of the Glutamate Glutamine Cycle\n\nhttps://en.wikipedia.org/wiki/Glutamate-glutamine_cycle\n\nIn your case additional L-Glutamine is likely causing an excess of Glutamate and this is contributing to your anxiety.\n\nIt's one reason I research carefully before taking any supplements recommended anecdotally. Since I suffer from anxiety and I know that Glutamine can contribute to anxiety if the system is out of balance then I have avoided it. Glutamine can definitely be a useful amino acid.\n\nThere is likely some fault in this Glutamate Glutamine GABA system and as I said I suspect L-Glutamine is causing excess Glutamate, you can read a small extract indicating the role of Glutamate in anxiety, there's plenty more information if you search for it. \n\nhttps://www.ncbi.nlm.nih.gov/pubmed/16400245\n\nAn enzyme malfunction is the likely cause, possibly multiple enzymes, you could research the enzymes involved and look at which nutrients can assist in their creation. You could also check your genetics but this is a lot more complex, you could have genetic polymorphisms that slow the enzyme/s function. There could be an entirely different reason based on your gut permeability, your microbiome function or something else. Please note you shouldn't use this information to directly diagnose you, as it's just guess work, it may provide clues for you.\n\nHave you looked at ways to improve your microbiome? Using prebiotics for example, my personal opinion is that providing the right home for the right microbiota is essential. Probiotics are far less useful in my opinion, a small course of powerful probiotics such as Elixa probiotics could be useful. I would avoid using any antibiotics unless you are in serious danger of death, that's the only time I would ever use them, they wipe out good and bad bacteria.\n\nAnyway I hope you find my comments useful.","created_utc":"1486480645"}
{"body":"There's plenty of substances that can relax you, many of them. I'm biased towards the compounds I list, and there's many I haven't tried. \n\nEtifoxine - Mild anxiolytic, has an effect on the GABA system but some anxiolytic effect from neurosteroid biosynthesis\n\nEmoxypine - Takes time to build up effect\n\nFasoracetam - Possible upregulation of GABA B receptor sub units.\n\nSelank - Anxiolytic for some people. \n\nBromantane - Mild psychostimulant and anxiolytic. \n\nKava - Can take time to have an effect, but definitely relaxing if you get the right chemotype. \n\nI would avoid any Gabapentoids which are Phenibut, Baclofen, Pregabalin and Gabapentin, all of these cause dependence, withdrawal and are not Nootropic. Phenibut is about the best of the Gabapentoids if you want a euphoric drugged up feeling, you will likely pay for indulging in this compound regularly though.","created_utc":"1486251037"}
{"body":"Unfortunately no. GABA system is very prone to tolerance (alcohol, Phenibut). It's always recommend using natural GABA enhancing techniques like running. Keep the supplements for occasional use as opposed to daily or frequent use. Take it from me my man, put in the work. 3-4 HIIT cardio sessions a week will do more than any supplement. Any other questions let me know man. Good luck. ","created_utc":"1488032420"}
{"body":"Like me, these people want to use Etifoxine and Glycine to stimulate neurosteroid biosynthesis  &gt;\n\nhttp://www.propeciahelp.com/forum/viewtopic.php?f=23&amp;t=5987&amp;start=20\n\nOne caveat with Etifoxine is it may cause withdrawal when stopped via the GABA system for want of a better description, it appears some of the anxiolytic action is generated by the drug stimulating neurosteroid biosynthesis. Some people say Etifoxine works well for anxiolysis and others say it does nothing, there's a lot of parameters involved that can skew the results, it's an interesting drug all the same. There's another more serious caveat that the drug may be hepatotoxic, again I'd need to research further. Sometimes this is not the case of the drug at fault but that the reported hepatoxicity was caused by something else the patient was taking at the time, as with Kava Kava. Certainly Paracetamol can be extremely hepatotoxic, so things need putting in to perspective.   ","created_utc":"1486041317"}
{"body":"Phenibut does the same thing to me now for up to a week after last use even if I take a few weeks off. I threw mine in the trash, and will never use it again. I use solely kava kava, magnesium, and ashwagandha now when I need relaxation, and only noble variety kava.\n\nI honestly think it's the brutal treatment of your GABA system from phenibut that is likely causing the majority of your problems. Some people are more sensitive to it than others, especially if alcoholism runs in your family. My advice: throw the shit in the trash and don't look back. GABA agonists are not the way to go.","created_utc":"1495859790"}
{"body":"I've seen some studies on here showing that gabapentin/prebagablin have long term negative effects worse than or equal to benzos... I think we've seen throughout countless drugs that work mainly on the brain's GABA system (alcohol, GHB/GBL, barbiturates, benzos, phenibut, etc.) that it is INCREDIBLY delicate and medicating long term to life time comes with several costs, usually memory, nerve issues, etc.  The GABA/Glutamate balance in your brain is what can cause seizures in most fatal withdrawals.  I wish I could still count how many seizures I have had from running out of benzos. It's actually pretty sad. No clinic I've been to understands that it takes a long time for you brain to heal. Last hospital visit was from a 8mg/day Xanax script I lost. I was \"tapered\" off of it in 5 days with 2 10mg Valiums down to 0 on day 5. Needless to say, I had around 6 or 7 seizures and had to buy illegal and RC benzos. The ER and ICU know absolute fuck all about any of this shit and how to fix it.","created_utc":"1492570030"}
{"body":"Alcohol killing brain cells is a myth. Alcohol has many actions in the brain, the compete way it works it's unknown, but it's known to affect the GABA system and cause eventual down regulation and exitotoxicity in withdrawal. I mention this because Kava appears to have effects on the GABA system but via a different method. It's doesn't have the same withdrawal effects of alcohol. Alcohol is implicated in cancer and there is no known safe amount of alcohol, just guidance on not exceeding a weekly amount of units, which differs between countries.\n\nIn some people there appears to be a reverse tolerance effect, I've certainly experienced it, whereby there's almost no or none effect with the first dose or few doses. ","created_utc":"1500319670"}
{"body":"Slow it down. Go back to water and juice only, good diet, probiotic, and vitamins. Give your body and brain a rest. Reset the system, your body/mind will start to repair themselves. After a few weeks start up with something like Fasoracetam if it still feels as if your Gaba system is out of wack. It may just be the addiction and withdrawal symptoms, so you gotta stay off the dope, boi.\n\nDrugs are bad mmmmkay.  ","created_utc":"1495930865"}
{"body":"Your GABA system is not something where you wanna just jump to megadoses of anything. You can actually die. Be careful.","created_utc":"1501397629"}
{"body":"Your gaba system is gonna be fucked down the road if you're using benzos and phenibut daily in those dosages... Protracted withdrawals are real and will leave you miserable. You're digging yourself into a hole","created_utc":"1513410666"}
{"body":"This is not the same. This is a neuro steroid which occurs naturally in the brain. It modulates the GABA system, this is one of the reasons that anti depressants work to reduce anxiety, because they activate the enzyme 3a-HSD which in turns produces  neuro steroids one of which is Allopregnanolone. So the theory is providing exogenous Allopregnanolone will positively affect the GABA system and be anxiolytic. However it's likely the brain will find ways to mitigate this and this produce tolerance.","created_utc":"1511473111"}
{"body":"I suspect that gaboxadol may be perfect (healing to the GABA system without negatives) and hence kept completely unavailable by the sickness industry.\n\nhttps://en.m.wikipedia.org/wiki/Gaboxadol","created_utc":"1513009941"}
{"body":"It's not the GABA system that is the problem.\n\nIt's prevention of the formation of synapses which is also how you treat neuropathic pain.  Its a double edged sword that as of right now, we have no solution for and may never have a solution for.","created_utc":"1513018806"}
{"body":"Amongst others due to activating 3a-HSD class of enzymes. Look under the heading Clinical Significance &gt;\n\nhttps://en.m.wikipedia.org/wiki/3α-Hydroxysteroid_dehydrogenase\n\nI would be careful supplementing any hormones, as you don't know the effectiveness of your enzymes within the many pathways. Tread carefully and keep dosages low and only raise if there's no effect. Anyway what am I saying, just be careful. \n\nThis drug effectively gives the brain Allopregnanolone which positively modulates the GABA system in the brain.\n\nNow here is the red flag tolerance to the effects of Allopregnanolone :\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3031054/\n\nSo I would be wary this drug can't suffer from tolerance effects at some point.","created_utc":"1512766921"}
{"body":"BPC-157 can be used to reverse the downregulation of dopamine from amphetamine abuse. Usually this is a system that is very elastic, and can recover. But if you are constantly engaging in activities that create a huge rush of dopamine like having an orgasm or doing drugs, then your mind may get used to that rewards system, and is much more slowly returned to homeoatasis. The phenomenons you mention are shared by me as well. My gaba system is additionally messed up from short term benzo usage and other gabaergic substances. ","created_utc":"1511283718"}
{"body":"Quite possibly.  It does have a mild calming effect.  I wish I'd have known about it when I was quitting etizolam.  It might not cut drug cravings much but I feel like it definitely has positive long-term benefits on the GABA system (not sure if that's the scientific word for it, lol.  But whatever part of the brain is responsible for GABA functions).  ","created_utc":"1505621406"}
{"body":"I really need to try black seed oil too, I keep hearing great things about it.  I was reading the post about bad effects on GABA system for those who smoked heavily as a kid (I did) which it seems like it could help with. Just like you I am also interested in its potentiation potential.  ","created_utc":"1505683029"}
{"body":"Since you've been prescribed it for so long, ill assume your doc thinks you need to be on it for life and so quitting is not an option. You might want to ask her to switch you over to an equivalent dose of a longer-lasting benzo like valium or klonopin since the effects will be more consistent and there wont be as much inter-dose withdrawal. \n\nIn terms of 'balancing' your gaba system theres not alot you can do while still being on benzos, since many long-term changes take place with benzo/alcohol use and it takes long-term abstinence to reverse those changes. \n\nBut there are some things that help. Emoxypine worked wonders for me, it made my dosages hit almost twice as hard and i was able to fairly easily cut my dosage in half over a couple of months. NMDA antagonists are often used to prevent tolerance buildup to opiates, but they work to some extent for almost everything. Memantine and Agmatine are both good for this purpose. You're already taking Taurine which is good. Good diet and exercise never hurts too.\n\n\n\n\n","created_utc":"1505275190"}
{"body":"Support for your Gaba system is what you need - Gaba is basically the impulse-control and self-regulatory master of all our neurotransmitters. Here is what I'm taking right now (can't guarantee this for everyone, but it has helped me).\n\n-Magnesium (try to get a quality source that is easily absorbed)\n\n-NAC (N-Acetyl Cysteine). This helps to support conversion of glutamate to Gaba, and provides a whole host of other benefits as well. \n\n-Fish oil / Krill Oil. For this, I also suggest getting a high quality source. Watch out oxidized (rancid) fish oils. I take a fairly high dose. \n\n-B Complex (make sure you get enough b6 specifically). B6 is needed to support conversion of glutamate into Gaba. \n\n-Panax Ginseng. This helps support a lot of things, but most specifically has been shown in studies to help improve working memory in adults (impaired working memory is a hallmark trait of adhd)","created_utc":"1505697432"}
{"body":"&gt; On what basis would we assume that these are different? \n\nOn the basis that there's no real reason to assume that they're the same to begin with. This is a fully unreasonable conclusion to infer, not only because that's not how things generally work, but because l-theanine etc. aren't even remotely mechanistically similar to benzodiazepines. l-theanine doesn't even interact with the GABA system directly; it's a glutamate modulator. Alcohol doesn't even drive cognitive decline unless consumed excessively, possibly because it [demonstrates genotoxic effects at high doses](https://www.ncbi.nlm.nih.gov/pubmed/23125219) among a bunch of other things. Alcohol's so damn complicated we have our own system dedicated to handling it.\n\nBy this rationale you could assume that caffeine is poison because it's a stimulant the same way cocaine is. That's nonsense. There's no such thing as a \"bad\" class of drugs. It's a false premise from the outset.","created_utc":"1506073212"}
{"body":"Which pharmaceuticals have you tried?\n\nI have life long anxiety, I stumbled across Mirtazapine, a lucky strike. It was the first anti depressant I ever took only 2 years ago, after suffering like a bitch (a figure of speech for effect) for 20 years+ with anxiety, the anxiety becoming ever more invasive and crippling. \n\nNow I don't believe in Serotonin model of depression. It's not about Serotonin or just Serotonin. Yes Mirtazapine does affect Serotonin receptors associated with anxiety, but it also affects 3a-HSD which is an enzyme which affects neuro steroid production in the brain, and to cut a long story short increase Allopregnanolone which in turn affects GABA system in the brain having a calming effect. \n\nLastly whilst we're here the French drug Etifoxine also affects neuro steroid production in the brain and GABA. It doesn't have significant liver problems associated with it. \n\nSo there's two drugs you may not have tried. Anxiety is not about taking a pill for a fix, but it's part of a plan to help your brain return to a state of much lesser anxiety. When you're very ill from being anxious then these drugs can be very useful. Also you need to be wise in choosing drugs that don't have a problem of making the anxiety worse, which can be attributed to benzodiazapine drugs for example. Fine as a short term solution, but if you're like me then anxiety doesn't do short term solutions. \n\nI must have taken over 200 supplements to try and treat anxiety. I've taken Zembrin as well. It's not on my list.\n\nHere's my best:\n\nBimuno Prebiotic\nA decent Probiotic containing L.Rhamnosus\nBacopa - Don't need this now, and currently don't take it\nL-Theanine sublingually when needed, maybe a couple times a week\nZinc Citrate 20mg 2-3 times a week\n\nMirtazapine for me has been better than any supplement, when I was badly ill, nothing was going to fix that anxiety except a pharmaceutical drug. For days where I start to lose my shit I make sure that I stick to taking what I've mentioned above. \n\nI strongly believe that modern life causes abnormal anxiety. I make sure every device I use filters out blue light. I make sure I practice relaxing and meditation. Anxiety is a pariah, a paranoid narcissist, it loves to hear about itself and reinforce its paranoia. You always have a choice whether to feed the anxiety or not, this may not seem true but I promise it's true.\n\nLastly I recommend reading the following books:\n\nMindfulness Finding Peace in a Frantic World\nThe Chimp Paradox by Dr Steve Peters\n\nThis is not a fool proof guide to anxiety. It's not a cure and looking for a cure just looks for a dead end which in effect reinforces the anxiety. You don't need a cure for anxiety, this is not the goal, the goal is to live a life with less intrusive anxiety. Believe it or not most people have anxiety often in their lives, but it's not a constant persistent menace. It doesn't have to be for you either. You may always be aware you're an anxious person but you can be in a place where you can cope with that. \n\n","created_utc":"1508279058"}
{"body":"&gt; Since i got my report I started eating clean and have lost 15 lbs.\n\nAt the very least that's a really good start and will probably be one of the biggest differences.\n\nIf you're after supplements than I'd say something to help out your GABA system like fasoracetam or emoxypine might be worth researching. One thing in particular would be to stay away from phenibut (which many people recommend for anxiety) if you've only recently quit drinking and are trying to get your baseline back to normal.","created_utc":"1507849803"}
{"body":"Phenibut has also a dopaminergic component in its effect (which explains your experience). So, instead of focusing on GABA system I think you could look into substances that repairs/boost *dopaminergic system*  : \nBPC-157 (I don't really know this substance but I often hear about it when people want to recover after amphetamine long-term use),  Bromantane (up-regulates tyrosine hydroxylase which produces dopamine), Uridine etc.","created_utc":"1496411935"}
{"body":"To avoid cognitive issues and still get anxiolysis, I would suggest taking afobazole. It also would be the most sustainable substance that affects the GABA system (through sigma 1 agonism). I actually found it to improve cognition modestly.\n","created_utc":"1496359310"}
{"body":"Phenibut seemed to sensitize my GABA system permanently and I ended up suffering severe withdrawals from any GABAergic, especially alcohol, in half the time it should have taken me to get there. I did not use either responsibility, and currently I use neither. It bothers me when people connotate ease of access with safety or tolerability though.","created_utc":"1496834923"}
{"body":"So how exactly you can uppregulate GABA system using nACh system?","created_utc":"1496493901"}
{"body":"Fasoracetam is of course an experimental drug. The possible GABA upregulation effects are discussed in this old paper &gt;\n\nhttp://www.sciencedirect.com/science/article/pii/S0014299997819255?via%3Dihub\n\nI think there's some confusion about Fasoracetam, in simplistic terms Caffeine (a generally anxiogenic drug) can upregulate GABA receptors so can exercise, these stresses on the body cause the brain to modulate the GABA receptor system to try and achieve balance. Fasoracetam possibly causes GABA upregulation by an indirect method, notice they mention repeated doses. Fasoracetam also modulates mGluR II/III activity in the brain. \n\nmGlu2/3 agonist, LY354740 (Eglumegad), was effective in the treatment of generalized anxiety disorder. So perhaps Fasoracetam takes time to modulate the mGluR system and this is the anxiolytic action and definitely this modulation could have an effect on the GABA system in the brain.\n\nIn the 1970's we didn't know about the mGlur system, I say system because there's modulating effects beyond the mGluR receptors. So here's a drug created in the 1970's which science didn't know how it worked\n\n https://en.wikipedia.org/wiki/Fenobam\n\nNotice its effects are on mGluR5 and because it has psychotomimetic effects it's possible it has direct or indirect action on NMDA receptors. We're only going to get better at treating anxiety, of course that should be obvious. But when you consider the complex interplay of biochemistry in the brain and the uniqueness to each person, and genetic expression, then it's a complex task all the same. People tend to think I need a drug that works on GABA or Serotonin which will relieve my anxiety, when the truth is far more complex. \n\nWhich is why I don't believe currently in the one pill fixes all treatment for anxiety. You can spend a long long long time trying to find a single compound that will always fix your anxiety, the brain doesn't work like that, it looks for balance. You can't possibly know if you have a chemical imbalance in the brain unless you caused it by consuming too much of a certain drug/supplement. GABAgenic compounds are a good example. So I'm fairly confident you won't find solice in Fasoracetam. Anxiety is a complex entity and it requires a multi modal approach to be really successful. So this is thought reframing via meditation/CBT, drug therapy where applicable, diet and exercise.  ","created_utc":"1496347876"}
{"body":"yeah me too. It used too work well but now my anxiety comes back harder the next day and I feel pretty shitty for a few days.\n\nMaybe it's because regular use changed the gaba system or something?\n\nI used 1-2grams per week in the past and have a mild feeling. But now I even feel sub 500mg doses like a 2gram dose. ","created_utc":"1485721113"}
{"body":"Yes I've been taking 500mcg orally before bed, and I've read it has healing/balancing effects on nervous systems. Anecdotally the first few times I took it I became very relaxed about an hour later. I believe it is rebalancing my GABA system as I've abused alcohol in the past.","created_utc":"1485555025"}
{"body":"Use this 3D n-back app for 15-20mins before doing at least 30mins moderate intensity exercise. Do this for a week or two... or ongoing if you like.. it stresses your working memory, which may be temporarily out of order as your brain recovers from the double dose of general anaesthetics..\n\nhttp://cognitivefun.net/test/22  \n\nAlso turn the hot water off during the last few minutes of your shower.  \n\nThese are some novel ways to stimulate neurogenesis and improved mood which will probably do you more good than any specific supplement.  \n\nAlso don't let your mind amplify the nocebo effect. For what it's worth, I just had general anaesthetic too (3 days ago) and I haven't noticed any serious cognitive sides.. propofol seems to work mainly on the GABA-A system from a 2 second wiki search so if there has been any desensitisation of your GABA system then you could also add in some mantra meditation (aka Transcendant Meditation without the marketing and cost) to help your GABA receptors come back online quicker... [here's a source for this part of my ramblings..](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4769029/#S3title)","created_utc":"1484470740"}